In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Empty DataFrame

In [4]:
#list
city = ['Dhaka','Chittagong','Noakhali']

In [5]:
city

['Dhaka', 'Chittagong', 'Noakhali']

In [6]:
df = pd.DataFrame(city)

In [7]:
df

            0
0       Dhaka
1  Chittagong
2    Noakhali

In [8]:
type(city)

list

In [9]:
row, col = df.shape

In [10]:
row

3

In [11]:
col

1

In [12]:
df.shape

(3, 1)

In [13]:
df

            0
0       Dhaka
1  Chittagong
2    Noakhali

In [14]:
df = pd.DataFrame(city, columns=['City_in_BD'])
df

   City_in_BD
0       Dhaka
1  Chittagong
2    Noakhali

In [15]:
df = pd.DataFrame(city, columns=['city_in_BD'], index=['c1','c2','c3'])
df

    city_in_BD
c1       Dhaka
c2  Chittagong
c3    Noakhali

In [16]:
city2 = ['khulna','Barishal','Shylet']

In [17]:
df2 = pd.DataFrame(zip(city,city2), columns=['city','city2'])

In [18]:
df2

         city     city2
0       Dhaka    khulna
1  Chittagong  Barishal
2    Noakhali    Shylet

In [19]:
df.shape

(3, 1)

In [20]:
df2

         city     city2
0       Dhaka    khulna
1  Chittagong  Barishal
2    Noakhali    Shylet

In [21]:
df2.shape

(3, 2)

# 2D list

In [22]:
city3 = [['Chatkhil','Sonaimuri'],['Maizdee','Sonapur']]

In [23]:
city3

[['Chatkhil', 'Sonaimuri'], ['Maizdee', 'Sonapur']]

In [24]:
df4 = pd.DataFrame(city3)

In [25]:
df4

          0          1
0  Chatkhil  Sonaimuri
1   Maizdee    Sonapur

In [26]:
df4 = pd.DataFrame(city3, columns=['State','City'])

In [27]:
df4

      State       City
0  Chatkhil  Sonaimuri
1   Maizdee    Sonapur

In [28]:
city

['Dhaka', 'Chittagong', 'Noakhali']

In [29]:
city2

['khulna', 'Barishal', 'Shylet']

In [30]:
# dict
dict1 = {
    'city1': city,
    'City2': city2
}

In [31]:
dict1

{'city1': ['Dhaka', 'Chittagong', 'Noakhali'],
 'City2': ['khulna', 'Barishal', 'Shylet']}

In [32]:
df5 = pd.DataFrame(dict1)

In [33]:
df5

        city1     City2
0       Dhaka    khulna
1  Chittagong  Barishal
2    Noakhali    Shylet

In [34]:
type(dict1)

dict